dot-irc.org
#+TITLE:Dot Emacs: IRC
#+AUTHOR: Brad Collins
#+EMAIL: brad@chenla.la
#+PROPERTY: header-args    :results drawer  :tangle emacs-irc.el

* Rcirc

The rcirc client is pretty good.  I have it set up to automatically
log in to three servers, and pull passwords from .authinfo.

 - [[http://www.shakthimaan.com/posts/2016/06/23/rcirc/news.html][GNU Emacs - rcirc IRC client]] | Shakthimaan's Blog
 - [[http://emacs.stackexchange.com/questions/10207/how-to-get-org2blog-to-use-authinfo-gpg][org mode - How to get org2blog to use .authinfo.gpg]]  | Emacs Stack Exchange
 - [[http://emacs.stackexchange.com/questions/12660/peculiar-error-triggered-when-calling-erc-org2blog-from-windows-os-x][Peculiar Error triggered when calling ERC, org2blog]]  | Emacs Stack Exchange

From the code, it's pretty easy to see who I am and where I hang out....


#+begin_src emacs-lisp
  ;; RCIRC =================================================
  ;; Register Nick on IRC Servers

  (rcirc-track-minor-mode 1)
  (setq rcirc-default-nick "deerpig")
  (setq rcirc-default-user-name "deerpig")
  (setq rcirc-default-full-name "Brad Collins")

  (setq rcirc-server-alist
     ;; the backtick is important
	`(("irc.freenode.net" :password ,(cadr (auth-source-user-and-password "irc.freenode.net")) 
                                      :channels ("#emacs" "#chenla"))
  	  ("irc.chenla.org"             :channels ("#chenla"))
        ("keyelementsg.irc.slack.com" :port 6697 :encryption tls
   	         :password ,(cadr (auth-source-user-and-password "keyelementsg.irc.slack.com"))
   	         :channels ("#general" "random"))
                 ))

#+end_src

#+RESULTS:
:RESULTS:
((irc.freenode.net :password vegetasucks :channels (#emacs #chenla)) (irc.chenla.org :channels (#chenla)) (keyelementsg.irc.slack.com :port 6697 :encryption tls :password keyelementsg.TK1ri6Z2InjMn6XcJYqI :channels (#general random)))
:END:
